Revit 2027 API
BuiltInFailures.PerformanceFailures.DisjoinedSolidsInInPlaceFamily Property
 In-place family contains multiple disjoined solids. Consider splitting in several in-place families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DisjoinedSolidsInInPlaceFamily { get; }
Public Shared ReadOnly Property DisjoinedSolidsInInPlaceFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DisjoinedSolidsInInPlaceFamily {
	FailureDefinitionId^ get ();
}
static member DisjoinedSolidsInInPlaceFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace